{
    "site name": "Site name shown in page title",
    "welcome": "Welcome message shown in page title of frontpage",
    "intro lead": "Introduction shown on frontpage",
    "intro message": "Introduction shown on frontpage",
    "find us on": "Introduction shown on frontpage",
    "from the dev diary": "Link to development diary shown on frontpage",
    "change language": "Language switcher shown at the bottom of every page",
    "german": "Language name in localization language, followed by language name in language described by the label, e.g. 'German (Deutsch)' for the German label in English. Omit native name if identical or not applicable.",
    "english": "Language name in localization language, followed by language name in language described by the label, e.g. 'German (Deutsch)' for the German label in English. Omit local name if identical or not applicable",
    "sign in": "Button for signing into the site",
    "register": "Button for registering an account",
    "papers please": "Intro shown on the login page",
    "username": "Label for the username field on login/registration pages",
    "enter username": "Placeholder for the username field on login/registration pages",
    "password": "Label for the password field on login/registraiton pages",
    "enter password": "Placeholder for the password field on login/registration pages",
    "no account yet": "Invitation to register account on registration page",
    "enter your info": "Instructions for creating an account and providing an invite code, shown on the registration page",
    "already got an account": "Invitation to login shown on the registration page",
    "enter email": "Placeholder for the email field on the registration page",
    "email optional": "Label for the email field on the registration page",
    "agree to terms": "Explanation shown on registration page that user will agree to terms by registering",
    "need username": "Error shown when the given field is missing from a form submission.",
    "need password": "Error shown when the given field is missing from a form submission.",
    "bad username": "Error shown when user tries to login with invalid credentials.",
    "bad password": "Error shown when user tries to login with invalid credentials.",
    "accesskey": "Tooltip shown on all links that have an access key (keyboard shortcut). See https://developer.mozilla.org/en-US/docs/Web/HTML/Global_attributes/accesskey for technical background.",
    "welcome new user": "Welcome notice shown after registration.",
    "sign out": "Button to log out",
    "already logged in": "Warning shown on registration page when user attempts to create an additional account while logged in.",
    "invalid email format": "Error shown on registration page when email appears invalid.",
    "invalid username characters": "Error shown on registration page when email contains invalid characters: %s",
    "unknown error": "Error message that is shown when an unknown error occurred processing form data on any form.",
    "username too long": "Error message that is shown if the given field exceeds the maximum length.",
    "email too long": "Error message that is shown if the given field exceeds the maximum length.",
    "password too short": "Error message that is shown when a password is deemed insecure because of its shortness.",
    "username exists": "Error message that is shown when a username already exists as the user attempts to register.",
    "write a review": "Title that is shown on the page for writing new reviews",
    "new review": "Button for writing a new review",
    "help": "Heading for context-sensitive help in different parts of the user interface"
}
