{
	"@metadata": {
		"authors": [
			"Liuxinyu970226",
			"Nike",
			"Robby",
			"Verdy p"
		]
	},
	"site name": "Site name shown in page title",
	"welcome": "Welcome message shown in page title of frontpage\n{{Identical|Welcome}}",
	"intro lead": "Introduction shown on frontpage",
	"intro message": "Introduction shown on frontpage. \"DM\" is an informal English abbreviation for a \"direct message\".",
	"find us on": "Introduction shown on frontpage. Notes:\n* The link to the IRC channel was changed to use Libera.Chat, instead of the previous hosting provider which must no longer be referenced in any translation.\n* The dummy parameter <code>&amp;feature=youtu.be</code> has no use on Youtube in the link provided for the short screencast. It is dropped when your visit the target site and should be removed from the given URL in translations. Youtube instead instructs to use this short URL \"https://youtu.be/vHX33WbLrVE\" for sharing videos as URLs on the web.",
	"change language": "Language switcher shown at the bottom of every page",
	"change language button": "Label fur button in the footer that executes a language change.",
	"sign in": "Button for signing into the site\n{{Identical|Sign in}}",
	"register": "Button for registering an account\n{{Identical|Register}}",
	"papers please": "Intro shown on the login page",
	"username": "Label for the username field on login/registration pages\n{{Identical|Username}}",
	"enter username": "Placeholder for the username field on login/registration pages",
	"password": "Label for the password field on login/registraiton pages\n{{Identical|Password}}",
	"enter password": "Placeholder for the password field on login/registration pages",
	"no account yet": "Invitation to register account on registration page",
	"invite link needed": "Message shown on the registration page explaining that new users need an invitation link to make an account",
	"enter your info": "Instructions for creating an account and providing an invite code, shown on the registration page",
	"already got an account": "Invitation to login shown on the registration page",
	"enter email": "Placeholder for the email field on the registration page",
	"email optional": "Label for the email field on the registration page",
	"agree to terms": "Explanation shown on registration page that user will agree to terms by registering",
	"need username": "Error shown when the given field is missing from a form submission.",
	"need password": "Error shown when the given field is missing from a form submission.",
	"bad username": "Error shown when user tries to login with invalid credentials.",
	"bad password": "Error shown when user tries to login with invalid credentials.",
	"accesskey": "Tooltip shown on all links that have an access key (keyboard shortcut). See https://developer.mozilla.org/en-US/docs/Web/HTML/Global_attributes/accesskey for technical background.",
	"welcome new user": "Welcome notice shown after registration.",
	"sign out": "Button to log out\n{{Identical|Sign out}}",
	"already logged in": "Warning shown on registration page when user attempts to create an additional account while logged in.",
	"invalid email format": "Error shown on registration page when email appears invalid.",
	"invalid username characters": "Error shown on registration page when email contains invalid characters: %s",
	"unknown error": "Error message that is shown when an unknown error occurred processing form data on any form.",
	"username too long": "Error message that is shown if the given field exceeds the maximum length.",
	"email too long": "Error message that is shown if the given field exceeds the maximum length.",
	"password too short": "Error message that is shown when a password is deemed insecure because of its shortness.",
	"username exists": "Error message that is shown when a username already exists as the user attempts to register.",
	"write a review": "Title that is shown on the page for writing new reviews",
	"new review": "Button for writing a new review",
	"help": "Heading for context-sensitive help in different parts of the user interface\n{{Identical|Help}}",
	"review url": "Label for URL field on review form",
	"review url help label": "Label for context-sensitive help for URLs on review form\n{{Identical|URL}}",
	"enter web address": "Placeholder for URL field on review form. Feel free to localize the example to a more familiar one in the language you're translating to, but please also adapt {{msg-libreviews|enter title}} if you do.",
	"review url help": "Context-sensitive help text for review URL on review form",
	"review title": "Label for title field on review form",
	"review title help label": "Label for context-sensitive help for title field on review form\n{{Identical|Title}}",
	"enter title": "Placeholder for title field for review form.  Feel free to localize the example to a more familiar one in the language you're translating to, but please also adapt {{msg-libreviews|enter web address}} if you do.",
	"review title help": "Context-sensitive help text for review title on review form",
	"review text help": "Context-sensitive help for review text on review form. Please preserve tabindex attribute for external links so they remain keyboard-accessible, and target so they open in new window.",
	"1 star help": "Context-sensitive help text for star rating on review form",
	"2 stars help": "Context-sensitive help text for star rating on review form",
	"3 stars help": "Context-sensitive help text for star rating on review form",
	"4 stars help": "Context-sensitive help text for star rating on review form",
	"5 stars help": "Context-sensitive help text for star rating on review form",
	"review text": "Label for review text\n{{Identical|Review}}",
	"enter review": "Placeholder for review text",
	"review rating": "Label for start rating\n{{Identical|Rating}}",
	"publish": "Button for publishing review and other content\n{{Identical|Publish}}",
	"preview": "Button for previewing review and other content\n{{Identical|Preview}}",
	"preview title": "Generic heading that is shown above content for some previews\n{{Identical|Preview}}",
	"new review terms": "Terms user agrees to by submitting a review. Please preserve link target so link opens in new window.",
	"add more": "Label for additional fields on review form",
	"review language": "Label for review language",
	"draft loaded": "Notice shown when a draft is loaded from browser storage (see https://developer.mozilla.org/en-US/docs/Web/API/Window/localStorage for technical background).",
	"abandon draft": "Button for abandoning a draft loaded from browser storage",
	"load frontpage": "Tooltip shown over logo to load the site front page.",
	"terms": "Link to terms of use\n{{Identical|Terms of use}}",
	"not a url": "Notice shown when user attempts to add invalid URL on review form",
	"add http": "Link action that prepends http:// prefix to an incomplete URL",
	"add https": "Link action that prepends https:// prefix to an incomplete URL",
	"freedom": "Footer notice informing user how to exercise freedoms they have with regard to content, community and software",
	"code": "Footer link to source code repository. %1$s is substituted with GitHub repository, %2$s with notabug mirror.\n{{Identical|Source code}}",
	"signin required": "Notice that signing in is required to perform an action, shown in multiple contexts",
	"complete all required fields": "Notice shown on multiple forms when user attempts to submit form without completing all required fields",
	"correct errors": "Notice shown on multiple forms when user attempts to submit form without correcting a previously reported validation error",
	"need review-url": "Notice shown on form when user submits form without providing the given field.",
	"need review-title": "Notice shown on form when user submits form without providing the given field.",
	"need review-text": "Notice shown on form when user submits form without providing the given field.",
	"need review-rating": "Notice shown on form when user submits form without providing the given field.",
	"unexpected form data": "Generic error when a form is submitted with unexpected data",
	"live preview": "Label for checkbox that toggles preview as the user creates content",
	"byline": "Byline shown under a review. %1$s is replaced with username link, %2$s is replaced with date.",
	"preview of": "Headline that is shown above the preview contents of a review. %s is substituted with the URL or label of the review subject.",
	"got it": "Button for dismissing a notice without additional action\n{{Identical|Got it}}",
	"invalid star rating": "Error that is shown if a user submits a form with an invalid rating",
	"review title too long": "Error that is shown if a user submits a form with text that is too long for the given field",
	"invalid language code": "Error that is shown if a user submits a form with a language code that is invalid",
	"feed": "Headline that is shown for activity feeds (currently just review feeds)",
	"one or multiple stars": "Text representation for the number of stars of a given review, used for example as ALT text\n{{Identical|Star}}",
	"one or multiple reviews": "Used as part of a summary line, currently only displayed for subjects with more than one review.\n{{Identical|Review}}",
	"review metrics": "Summary line for review metrics. %1$s is substituted with the parametrized content of 'one or multiple stars', and %2$s is substituted with the parametrized content of 'one or multiple reviews'.",
	"captcha intro": "CAPTCHA introduction on some forms, currently unused. So <code>___</code> represents a missing word in the sentence.",
	"question: famous painting": "Simple CAPTCHA for some forms, feel free to adapt question and answer to local context consistent with key name. So <code>___</code> represents a missing word in the sentence.\n\nSee {{msg-libreviews|answer: famous painting}}",
	"answer: famous painting": "Simple CAPTCHA for some forms, feel free to adapt question and answer to local context consistent with key name.\n\nSee {{msg-libreviews|question: famous painting}}",
	"question: famous composer": "Simple CAPTCHA for some forms, feel free to adapt question and answer to local context consistent with key name. So <code>___</code> represents a missing word in the sentence.\n\nSee {{msg-libreviews|answer: famous composer}}",
	"answer: famous composer": "Simple CAPTCHA for some forms, feel free to adapt question and answer to local context consistent with key name.\n\nSee {{msg-libreviews|question: famous composer}}",
	"question: famous scientist": "Simple CAPTCHA for some forms, feel free to adapt question and answer to local context consistent with key name. So <code>___</code> represents a missing word in the sentence.\n\nSee {{msg-libreviews|answer: famous scientist}}",
	"answer: famous scientist": "Simple CAPTCHA for some forms, feel free to adapt question and answer to local context consistent with key name.\n\nSee {{msg-libreviews|question: famous scientist}}",
	"enter captcha answer": "Placeholder for CAPTCHA answer",
	"need captcha-answer": "Notice that user needs to complete CAPTCHA to proceed",
	"incorrect captcha answer": "Error that informs user CAPTCHA answer on a form is incorrect",
	"invalid url": "Error that informs user that a submitted URL is invalid.",
	"more info": "Link shown in a review heading pointing to page about review subject, which may contain additional reviews and information",
	"add label": "Button on a page about a review subject that lets user add a label for the subject",
	"add description": "Button on a page about a review subject that lets user add a description for the subject",
	"edit": "Generic button or link text to edit a given item\n{{Identical|Edit}}",
	"edit label": "Button on a page about a review subject that lets user edit a label for the subject",
	"edit description": "Button on a page about a review subject that lets user edit a description for the subject",
	"thing not found title": "Title for page informing user that a given review subject ('thing' in our parlance) was not found",
	"thing not found": "Content for page informing user that a given review subject was not found",
	"file not found title": "Title of the page that is shown when the user attempts to access an uploaded file that does not exist.",
	"file not found": "Text of the page that is shown when the user attemts to access an uploaded file that does not exist.",
	"review not found title": "Title for page informing user that a given review was not found",
	"review not found": "Content for page informing user that a given review was not found",
	"enter label": "Placeholder for field that lets user add a label to a review subject",
	"enter thing description": "Placeholder for field that lets user add a description to a review subject",
	"save": "Generic button for saving content\n{{Identical|Save}}",
	"cancel": "Generic link label for cancelling a form submission\n{{Identical|Cancel}}",
	"review of": "Title that is shown on review pages, %s is substituted with review subject\n{{Identical|Review}}",
	"permission error": "Generic error message that is shown if a user attempts to perform an action they do not have permission to perform",
	"permanent link": "Generic label for links to an item using a permanent identifier that will not change even if the item changes\n{{Identical|Permalink}}",
	"something went wrong": "Title for generic error message if a software error occurred that was not anticipated",
	"report an error": "Content for generic error message if a software error occurred that was not anticipated",
	"error details": "For users with sufficient privileges encountering an error, headline for additional details that are exposed along with a generic error",
	"delete": "Generic button or link label for deleting an item\n{{Identical|Delete}}",
	"page not found title": "Title for a generic message shown when a resource was not found and the resource type could not be identified",
	"page not found": "Content for a generic message shown when a resource was not found and the resource type could not be identified",
	"delete review": "Link label for deleting a review",
	"delete file": "Title of the page that is shown when the user attempts to delete an uploaded file.",
	"edit review": "Link label for editing a review",
	"delete preamble": "Generic notice shown when deleting content",
	"also delete thing": "When deleting a review, label for checkbox that lets users with sufficient privileges delete review subject along with the review. %s is substituted with identifier of review subject",
	"need delete-action": "Error shown on incomplete delete form submission",
	"review deleted": "Title for notice that is shown after a review has been deleted",
	"review has been deleted": "Content for notice that is shown after review has been deleted",
	"file deleted": "Title of the page that is shown when the user has successfully deleted an uploaded file.",
	"file has been deleted": "Text of the page that is shown when the user has successfully deleted an uploaded file.",
	"editing in language": "<b>Please change the language name from 'English' to the language you're translating to.</b> Permanently dismissible notice that is shown when editing a review subject's metadata, informing the user that they are writing in the language you're translating this message to",
	"writing a review in language": "<b>Please change the language name from 'English' to the language you're translating to.</b> Permanently dismissible notice that is shown when editing a review, informing the user that they are writing in the language you're translating this message to",
	"never show this again": "Generic button for permanently dismissing a dismissible notice",
	"notice suppressed": "Title for success message when a dismissible notice has been dismissed, if JavaScript is disabled",
	"notices of type suppressed": "Content for success message when a dismissible notice has been dismissed, if JavaScript is disabled",
	"unsupported notice": "Title for error that is shown when the software does not recognize a notice the user is attempting to dismiss",
	"unsupported notice type": "Content for error that is shown when the software does not recognize a notice the user is attempting to dismiss",
	"notice type language-notice-review": "Preference label for dismissible notices shown on review pages",
	"notice type language-notice-thing": "Preference label for dismissible notices shown on review subject pages",
	"close this window": "Message that is shown in a new window when the user dismisses a dismissible notice without JavaScript",
	"could not complete action": "Generic error message that is shown when a client-side request to an API fails and a given action could not be completed as a result",
	"site notification": "Generic text that is prepended to site-wide notifications\n{{Identical|Notification}}",
	"site error": "Generic error that is prepended to site-wide error messages\n{{Identical|Error}}",
	"notification language-changed": "<b>Please change the language name from 'English' to the language you're translating to.</b> Site-wide notification that is shown when the user has changed their language to the language you're translating this message to",
	"invalid language": "Error message that is shown when user attempts to switch to a language that is not recognized",
	"edit saved": "Slightly whimsical success message that is shown when an edit has been saved",
	"current language": "Label that is shown next to the language selector.\n{{Identical|Language}}",
	"user": "Title for a user page. %s is substituded with the user's name\n{{Identical|User}}",
	"user not found": "Title message that is shown when a given user page could not bef ound",
	"user not found text": "Content for message that is shown when a given user page could not be found",
	"user bio": "Label for user's bio (short biographical details) that can be optionally added on the user page\n{{Identical|Bio}}",
	"add bio": "Button for adding a user bio on the user page",
	"edit bio": "Button for editing a user bio on the user page",
	"user registration date": "Label for registration date that is shown on the user page",
	"user teams": "Label for user's team memberships taht is shown on the user page",
	"no teams yet": "Text that is shown when a given user is not a member of any teams yet",
	"max characters": "Text that is shown below the bio field on user page when editing bio, indicating maximum length of the field",
	"remaining characters": "Text that is shown indicating number of characters user still can add to bio in bio field on user page, %s is substituted with number",
	"over maximum": "Text that is shown indicating number of characters by which user has exceeded the allowable maximum in bio on user page, %s is substituted with number",
	"supports markdown": "Generic help text that is shown when a given field supports markdown formatting",
	"data missing": "Generic error message that is shown when a form submission was incomplete",
	"team not found": "Content for message that is shown when a given team could not be found",
	"team not found title": "Content for message that is shown when a given team could not be found",
	"new team": "Title for page for creating new teams",
	"team name": "Label for team name field in form for creating/editing teams",
	"enter team name": "Placeholder for team name field",
	"team motto": "Label for team name motto field in form for creating/editing teams",
	"enter team motto": "Placeholder for team motto field",
	"team description": "Label for team description field in form for creating/editing teams",
	"enter team description": "Placeholder for team description field",
	"team rules": "Label for team rules field in form for creating/editing teams",
	"team rules label": "Label for team rules section on team page",
	"team rules help label": "Label for help text regarding team rules in form for creating/editing teams",
	"enter team rules": "Placeholder for team rules field",
	"mod approval to join": "Label for checkbox in form for creating/editing teams",
	"only mods can blog": "Label for checkbox in form for creating/editing teams",
	"team name help": "Help text for team name field in form for creating/editing teams",
	"team motto help": "Help text for team motto field in form for creating/editing teams",
	"team description help label": "Label for help text for team description field in form for creating/editing teams",
	"team description help": "Help text for team description field in form for creating/editing teams",
	"team rules help": "Help text for team rules in form for creating/editing teams. Please preserve tabindex and target attribute of links to ensure keyboard accessibility / prevent loss of form contents.",
	"maintenance mode": "Title for message indicating that the site is down temporarily",
	"in maintenance mode": "Content for message indicating that the site is down temporarily",
	"need team-name": "Notice shown on form when user submits form without providing the given field",
	"need team-motto": "Notice shown on form when user submits form without providing the given field",
	"need team-description": "Notice shown on form when user submits form without providing the given field",
	"need team-rules": "Notice shown on form when user submits form without providing the given field",
	"team title": "Title shown on team page. %s is substituted with the team's name\n{{Identical|Team}}",
	"team blog": "Title for team blog. %s is substituted wit hthe team's name",
	"latest blog posts": "Headline for excerpt from team blog shown on team page",
	"join this team": "Headline for section of team page related to joining a team",
	"join": "Button for joining a team\n{{Identical|Join}}",
	"request membership": "Button for requesting membership in a team that requires approval",
	"approval required to join": "Notice informing user on team page that approval is required before they can join team",
	"agree to the rules": "Label for checkbox indicating that user agrees to the rules for joining a team",
	"no blog posts": "Notice indicating that a team blog does not have any content yet",
	"write a blog post": "Button for adding a post to a team blog",
	"must be trusted": "Additional explanation for permission error when untrusted user attempts to create a team",
	"edit team": "Button for editing a team",
	"delete team": "Button for deleting a team",
	"team deleted": "Title for message showing that a team has been deleted",
	"stale revision error title": "Title for message shown when attempting to retrieve a stale revision",
	"stale revision error": "Content for messsage shown when attempting to retrieve a stale revision",
	"team has been deleted": "Content for message showing that a team has been deleted",
	"browse teams": "Title for page providing a list of all teams",
	"new blog post": "Button for writing a new team blog post. Can be translated as infinitive.",
	"blog post title": "Label for title field on blog form",
	"blog post title help label": "Label for help text for title field on blog form\n{{Identical|Title}}",
	"blog post title help": "Help text for title field on blog form.",
	"blog post text": "Label for blog post text on blog form\n{{Identical|Text}}",
	"blog post text help": "Help text for blog post text on blog form. Please preserve the target and tabindex attributes in links to ensure form contents are not lost, and that the link remains keyboard accessible.\n\nNote: the default URL of the link target for Markdown in the source message in English to \"http://help.wtf/md\" is not secured, and points to a page only in English. If possible, you may replace it with a comparable page translated in the target language of this translation, it should preferably by secured (using HTTPS), and published on a free page under a free licence, and without required tracking cookies for advertizing to preserve the privacy of referers.",
	"blog post page title": "Title for blog post on blog form. %s is substituted with the title",
	"enter blog post title": "Placeholder for blog post title field on blog form",
	"enter blog post": "Placeholder for blog post text field on blog form",
	"need post-title": "Notice shown on form when user submits form without providing the given field.",
	"need post-text": "Notice shown on form when user submits form without providing the given field.",
	"post not found title": "Title for message shown when the given blog post could not be found",
	"post not found": "Content for message shown when the given blog post could not be found",
	"edit blog post": "Title for blog post form when editing a blog post",
	"delete blog post": "Title for page for deleting a blog post",
	"blog post deleted": "Title for message shown when a blog post has been deleted",
	"blog post has been deleted": "Content for message shown when a blog post has been deleted",
	"database downloads": "Title for page offering database downloads",
	"older reviews": "Link label for navigating to older reviews",
	"teams intro": "Introduction shown on page showing a list of all teams",
	"create your own team untrusted": "Instructions shown on page showing a list of all teams if the user does not have permission to create a team yet",
	"start team preamble": "Instructions shown at the top of the form for creating a new team",
	"must agree to team rules": "Error shown when user attempts to join team without agreeing to the team rules",
	"moderator badge": "Indicator badge next to a username shown if the user is moderator of a given team\n{{Identical|Moderator}}",
	"founder badge": "Indicator badge next to a username shown if the user is founder of a given team\n{{Identical|Founder}}",
	"number of members": "Label on team page for the number of members of a given team",
	"view list": "Link on team page for getting a list of all members of a given team",
	"moderators": "Label on team page for the moderators of a given team\n{{Identical|Moderator}}",
	"membership roster": "Title on page providing a list of all members of a given team. %s is substituted with team name",
	"welcome to the team": "Text for notification shown when user has joined a given team",
	"leave team": "Button for leaving a team. Can be translated as infinitive.",
	"goodbye team": "Text for notification shown when user has left a given team",
	"application received": "Text for notification shown on team page when a team membership request is pending",
	"application rejected": "Text for notification shown on team page when a team membership request has been rejected. %s is substituted with the date when the request was rejected.",
	"application rejected with reason": "Text for notification shown on team page when a team membership request has been rejected, and the moderator has provided a reason. %1$s is substituted with the date, %2$s with the reason text.",
	"pending join request": "Text for notification shown on the team page when there is a pending request to join the team. %s is substituted with a full link to the request.",
	"pending join requests": "Text for notification shown on the team page when there are multiple pending join requests. %2$s is substituted with the number, and %1$s is subsitituted with a link to the list of requests.",
	"no pending join requests": "Text shown on the page for managing membership requests if there are no pending requests",
	"manage join requests": "Title for the page for managing membership requests",
	"join request message": "Label shown next to a user-authored message provided along with with a team membership request by the prospective member\n{{Identical|Message}}",
	"choose action": "Label for the action that is to be taken on a given team membership request",
	"defer request": "Label for an action on a given team membership request",
	"reject request": "Label for an action on a given team membership request",
	"accept request": "Label for an action on a given team membership request",
	"enter message": "Label for a text field for an optional rejection message a moderator can provide when rejecting a team membership request",
	"process requests": "Button for processing team membership requests",
	"request by": "Label for the text that shows the name of a user who wants to join a team",
	"request date": "Label for the date of a membership request\n{{Identical|Date}}",
	"no requests to process": "Error message that is shown when the form to process membership requests was submitted but contained no actions",
	"requests have been processed": "Notification that is shown when at least one team membership request has been processed",
	"user feed": "Headline for list of reviews of a given user, %s is substituted with the user name",
	"atom feed of all reviews": "Description of the Atom feed of all reviews across the site, visible to feed readers that offer subscribers a choice between multiple feeds embedded in a page",
	"review feed label": "Label for the review subject in an Atom feed\n{{Identical|Review}}",
	"atom feed of reviews by this user": "Description of the Atom feed of all reviews by a given user, visible to feed readers that offer subscribers a choice between multiple feeds embedded in a page",
	"atom feed of blog posts by team": "Description of the Atom feed of all blog posts by a given team, visible to feed readers that offer subscribers a choice between multiple feeds embedded in a page",
	"older blog posts": "Link label for viewing older blog posts than the ones shown on the page",
	"writing review of": "Label for the subject of a review if the user is adding a review to a thing that already has been previously reviewed",
	"sign in to review": "Message shown on the page about a review subject (thing) if the user is not logged in",
	"your review": "Headline for the user's own review on the page about a review subject",
	"reviews": "Headline for all reviews on the page about a review subject\n{{Identical|Review}}",
	"other reviews": "Headline for reviews not written by the user on the page about a review subject, where the user has also written their own review",
	"you already wrote a review": "Message shown when the user attempts to create more than one review of a given review subject",
	"add your review": "Button for adding a review of a given review subject (thing)",
	"editing review of": "Label for the subject of a review when editing it",
	"reviews of": "Title for the Atom feed of all reviews of a given review subject. %s is substituted with the label or URL.",
	"atom feed of all reviews of this item": "Description of the Atom feed of all reviews of a given review subject (thing), visible to feed readers that offer subscribers a choice between multiple feeds embedded in a page",
	"spoiler warning": "Text for markdown blocks fenced in ::: spoiler - see https://en.wikipedia.org/wiki/Spoiler_(media) if you are unfamiliar with the term",
	"nsfw warning": "Text for markdown blocks fenced in ::: nsfw - see https://en.wikipedia.org/wiki/Not_safe_for_work if you are unfamiliar with the term",
	"add media": "Button for selecting one or multiple files to upload regarding a review subject",
	"select file": "Button label for modal dialog that is used to upload an individual file within the rich-text editor",
	"upload and insert media": "Label and headline that is used within the rich-text editor to instantly upload and insert a file.",
	"related to": "Sub-header shown on the file upload page to refer back to the review subject. %s is substituted with review subject label.",
	"upload completed": "Success message after an upload",
	"no file received": "Error message shown if the upload form is submitted without any file",
	"uploaded media": "Heading for the subject of a review that lists files uploaded that relate to the subject",
	"one file selected": "Message shown on the file selector button for uploads if a single file is selected",
	"files selected": "Message shown on the file selector button for uploads if more than one file is selected",
	"please complete your upload": "Explanation shown after an upload that indicates the user has to take additional steps",
	"filename": "Label for the filename field in step 2 of the upload process\n{{Identical|Filename}}",
	"upload description": "Label for the upload description field in step 2 of the upload process",
	"upload description help": "Help text for upload descriptions",
	"enter description": "Placeholder for the upload description field in step 2 of the upload process",
	"start upload": "Button to begin an upload process",
	"finish upload": "Button to finalize an upload process once all data has been provided",
	"my own work": "Radiobutton selection for an upload that indicates that the file is the user's own work.",
	"someone else's work": "Radiobutton selection for an upload that indicates the file is someone else's work",
	"someone else's work specified": "Label that is shown within the rich-text editor once a user has specified the license for a media file they have uploaded.",
	"enter creator name": "Placeholder text for the creator of an uploaded file",
	"creator": "Label for the creator field of an uploaded file",
	"creator help": "Help text for the creator field of an uploaded file",
	"source": "Label for the source field of an uploaded file",
	"enter source": "Placeholder for the source field of an uploaded file",
	"source help label": "Label for the source help text of an uploaded file\n{{Identical|Source}}",
	"source help": "Help text for the source field of an uploaded file",
	"license": "Label for the license field of an uploaded file\n{{Identical|License}}",
	"select license": "Label for the dropdown that lets the user select a license for a file they have uploaded from within the rich-text editor.",
	"fair use": "Radiobutton selection for an upload that satisfies  US law's fair use provisions according to the uploader",
	"cc-0": "Radiobutton selection for an uploaded file under CC-0 license or in the public domain",
	"cc-by": "Radiobutton selection for an uploaded file under CC-BY license",
	"cc-by-sa": "Radiobutton selection for an uploaded file under CC-BY-SA license",
	"fair use short": "Label that is used whenever we need to identify 'fair use' media content in menus and lists",
	"cc-0 short": "Label that is used whenever we need to identify CC-0 or public domain media content in menus and lists",
	"cc-by short": "Label that is used whenever we need to identify CC-BY media content in menus and lists",
	"cc-by-sa short": "Label that is used whenever we need to identify CC-BY-SA media content in menus and lists",
	"unsupported file type": "Error message shown if user attempts to upload a file of a type that is not accepted by the site. %1$s is substituted with the filename, %2$s is substituted with the apparent file type",
	"unrecognized file type": "Error message shown if user attempts to upload a file whose file type cannot be detected. %s is substituted with the filename.",
	"mime mismatch": "Error message shown if user attempts to upload a file whose actual MIME type seems to be different than the form submission suggests (could be forged request, could be a file with the wrong extension). %1$s is substituted with the filenme, %2$s with the expected MIME type and %3$s with the actual MIME type.",
	"not valid svg": "Error message shown if user attempts to upload an SVG file that does not pass a shallow validation",
	"upload needs description": "Error message shown if user attempts to submit form without providing the given required field. %s is substituted with the filename.",
	"upload needs creator": "Error message shown if user attempts to submit form without providing the given required field. %s is substituted with the filename.",
	"upload needs source": "Error message shown if user attempts to submit form without providing the given required field. %s is substituted with the filename.",
	"upload needs license": "Error message shown if user attempts to submit form without providing the given required field. %s is substituted with the filename.",
	"teams to associate": "Heading for checkbox list of teams in the form for creating or editing reviews",
	"not member of any teams yet": "Notice we show in the form for creating or editing reviews if user is not member of any teams. Please preserve link target to avoid loss of form data.",
	"submitted team could not be found": "Error message shown if user attempts to submit a review with a team that could not be found",
	"user is not member of submitted team": "Error message shown if user attempts to submit a review with a team they are not a member of",
	"posted under": "Shown below a review, to indicate team associations and possibly other categorization in future.",
	"team page": "Shown next to a team's name on a review form, linking to its team page",
	"latest review": "Headline for the latest review shown on a team's page",
	"team feed": "Title for feed of reviews associated with a given team",
	"atom feed of reviews by team": "Embedded metadata description for Atom feed of all reviews by a given team",
	"no reviews for team": "Message shown on a team page if the team has not been associated with any reviews",
	"no reviews for user": "Message shown on a user page if the uesr has not authored any reviews",
	"view all": "Generic label for a link that leads to a list of all items with pagination, e.g., blog posts, reviews, etc.",
	"faq acronym": "Short form of the 'Frequently Asked Questions' title. If no common acronym in your language, use English if familiar, otherwise spell out.\n{{Identical|FAQ}}",
	"faq": "Title of the 'Frequently Asked Questions' page (long form).\n{{Identical|Frequently asked questions}}",
	"help us grow": "Text shown as a tooltip on every page if a user can generate invite links. If more than one, %s is substituted with the number.",
	"invite users intro": "Introduction text shown on the page where users can generate invite links used to register an account",
	"you can generate links": "Text shown on the invite page if the user can generate new invite links. If more than one, %s is substituted with the number.",
	"generate link": "Label for the button used to generate an invite link (can be translated as infinitive)",
	"out of links": "Error message shown if user attempts to generate links but has exceeded the number they have",
	"link generated": "Message shown immediately after a user creates an invite link",
	"invite users": "Title for the page where users can generate invite links",
	"pending invitations": "Headline for section showing invite links that have been generated but not used to register an account yet",
	"accepted invitations": "Headline for section showing invite links that have been used to register an account",
	"invite link": "Label used wherever we show actual invite links (noun)",
	"created on": "Label for date a given invite link was created",
	"accepted by": "Label for name of the user who used a given invite link to make an account",
	"accepted on": "Label for date a user used a given invite link to make an account",
	"copy": "Label for buttons that copy text into the clipboard. Translate as infinitive.\n{{Identical|Copy}}",
	"invite link invalid title": "Title for page shown if a given invite link is invalid (code not recognized)",
	"invite link invalid": "Text for page shown if a given invite link is invalid",
	"invite link already used title": "Title for page shown if a given invite link has already been used to register an account",
	"invite link already used": "Text for page shown if a given invite link has already been used",
	"language temporarily changed": "Message shown if the language of a page is temporarily changed using the ?uselang parameter. Change the word 'English' to the name of the language you are translating this message to. %1$s will be substituted with the name of the language the user would see if ?uselang was not set.",
	"change language permanently": "Label for button that will make a ?uselang selection permanent. Change the word 'English' to the name of the language you are translating this message to.",
	"reload this page": "Label for link to undo a ?uselang language selection for a given page. %s will be substituted with the name of the user's currently configured language.",
	"explore teams": "Headline shown on the main page to highlight some randomly selected teams.",
	"team intro": "Explanation that is shown on the frontpage.",
	"duplicate team name": "Warning that is shown after saving a team if there is a name collision.",
	"thing label help": "Help text that is shown next to the input for review subject (thing) labels.",
	"thing description help": "Help text that is shown next to the input for review subject (thing) descriptions.",
	"search lib.reviews": "Text that is shown as a placeholder inside the search box, and as a headline on the standalone search page.",
	"search results": "Headline that is shown on the search results page.\n{{Identical|Search results}}",
	"no results": "Message that is shown when no search results could be found.",
	"matches in review subjects": "Headline that is shown on the search result page for text matches in review subjects (thing labels).",
	"matches in review text": "Headline that is shown on the search result page for text matches in review text.",
	"one or multiple matches": "Text that is shown on the search result page to highlight how many reviews of a given thing matched the entered search text.",
	"search help": "Help text that is shown on the search page. Feel free to localize the examples, however, you're encouraged to keep \"quotation marks (marks \"\", not words)\" as is, i.e. other quotation marks' styles such as <code><nowiki>'', „”, “”, 「」, 『』, ‘’, and «»</nowiki></code> are not handled correctly.",
	"show more": "Label for a control that expands a section of text shortened to reduce clutter.\n{{Identical|Show more}}",
	"show less": "Label for a control that collapses a previously expanded section of text.",
	"development diary": "Headline used on the frontpage for the section which shows selected posts from the development diary.",
	"markdown format": "(Rendered in all-caps.) Label for button that lets the user switch from rich text editing to markdown editing",
	"rich text format": "(Rendered in all-caps.) Label for button that lets the user switch from markdown editing to rich text (visual) editing. Feel free to pick the translation that best corresponds to the meaning, or a term like WYSIWYG if it is more commonly used.",
	"insert media": "Label for pull down menu item in the rich text editor\n{{Identical|Image}}",
	"insert media help": "Tooltip for the pull down menu item to insert an image, video or sound file",
	"insert media dialog title": "Title for the dialog that lets the user insert an image, video or sound file by URL",
	"insert": "Label for the pull down menu that lets the user insert images and other content\n{{Identical|Insert}}",
	"insert help": "Tooltip for the pull down menu that lets the user insert images and other content",
	"insert horizontal rule": "Label for the pull down menu item to insert a horizontal rule",
	"insert horizontal rule help": "Tooltip for the pull down menu item to insert a horizontal rule",
	"media url": "Field name for the dialog to insert an image, video or sound file by URL in the rich text editor",
	"media alt text": "Field name for the dialog to insert an image, video or sound file by URL in the rich text editor. Used for the ALT text read by screen readers and other accessibility tools, or the fallback text in the case of video and audio files.",
	"add or remove link": "Tooltip for the menu button that lets the user add or remove a link in the rich text editor",
	"add link dialog title": "Title for the dialog that lets the user add a link in the rich text editor (removal is done without a dialog).",
	"web address": "Form header on page for managing links associated with a review subject.",
	"link text": "Label in rich text editor dialog for inserting links that allows the user to specify plain text to which the link is applied.",
	"toggle bold": "Tooltip for the button that lets the user toggle bold formatting in the rich text editor",
	"toggle italic": "Tooltip for the button that lets the user toggle italic formatting in the rich text editor",
	"toggle code": "Tooltip for the button that lets the user toggle inline code formatting in the rich text editor",
	"format block": "Label for the pull down menu that lets the user format a whole block or paragraph in the rich text editor. Can be translated as noun or verb, whichever is shorter.\n{{Identical|Format}}",
	"format block help": "Tooltip for the pull down menu that lets the user format a whole block or paragraph in the rich text editor",
	"format as bullet list": "Tooltip for the button that formats the current paragraph as a bullet point list item in the rich text editor",
	"format as numbered list": "Tooltip for the button that formats the current paragraph as a numbered list item in the rich text editor",
	"format as quote": "Tooltip for the button that formats the current paragraph as a quotation in the rich text editor",
	"format as paragraph help": "Tooltip for the pull down menu item that lets the user format the current block as a plain text paragraph in the rich text editor",
	"format as paragraph": "Label for the menu item that lets the user format the current block as a plain text paragraph in the rich text editor\n{{Identical|Paragraph}}",
	"format as code block": "Label for the pull down menu item that lets the user format the current block as code in the rich text editor\n{{Identical|Code}}",
	"format as code block help": "Tooltip for the menu item that lets the user format the current block as code in the rich text editor",
	"format as heading": "Label for the pull down menu item that lets the user format the current block as a headline in the rich text editor\n{{Identical|Heading}}",
	"format as level heading help": "Tooltip for sub-menu item that lets the user format the current block as a heading of the level substituted into %d (1-6)",
	"format as level heading": "Label for sub-menu item that lets the user format the current block as a heading of the level substituted into %d (1-6)\n{{Identical|Level}}",
	"format as spoiler": "Label for the pull down menu item that lets the user format the current block as a spoiler that is collapsed by default.\n{{Identical|Spoiler}}",
	"format as spoiler help": "Tooltip for the menu item that lets the user format the current block as a spoiler",
	"format as nsfw": "Label for the pull down menu item that lets the user format the current block as 'not-safe-for-work' (adult or otherwise explicit) and collapsed by default.",
	"format as nsfw help": "Tooltip for the menu item that lets the user format the current block as 'not-safe-for-work'",
	"format as custom warning": "Label for the pull down menu item that lets the format text so is collapsed by default, with a custom warning text rendered on top of it.",
	"format as custom warning help": "Tooltip for the menu item that lets the user format text as collapsed by default with a custom warning",
	"format as custom warning dialog title": "Headline for dialog in rich-text-editor where user can enter custom warning text that is shown for collapsed content",
	"custom warning text": "Placeholder for input field where user can enter custom warning text that is shown for collapsed content",
	"undo": "Tooltip for the button that lets the user undo a change in the rich-text editor",
	"redo": "Tooltip for the button that lets the user redo a change in the rich-text editor",
	"join with item above": "Tooltip for the button that combines items,  e.g. two bullet point items into one, in the rich text editor",
	"decrease item indentation": "Tooltip for the button that decreases the indentation level of items in the rich text editor",
	"required field": "Label for the balloon message shown in dialogs in the rich-text editor that have required fields (e.g., image URL for images)",
	"ok": "Label for the button to confirm a dialog in the rich-text editor\n{{Identical|OK}}",
	"remember rte preference": "Tooltip for the pin that is shown next to the rich-text editor mode switcher to let the user make the preference 'sticky'.",
	"forget rte preference": "Tooltip for the pin that is shown next to the rich-text editor mode switcher to go back to the default markdown editor.",
	"full screen mode": "Tooltip for the button that switches into full screen mode in the rich-text editor.",
	"not a member of team title": "Title for the page that is shown when the user attempts to access the form to create a new review for a given team, but is not a member of said team.",
	"not a member of team": "Body for the page that is shown when the user attempts to access the form to create a new review for a given team, but is not a member of said team.",
	"review label": "Label for label field in the review form (e.g., for entering the title of a book)",
	"review subject": "Label that is shown above the review subject in the review form when a review subject is chosen, e.g., from Wikidata.",
	"enter label for review subject": "Placeholder for label field in the review form. Feel free to localize the example consistent with the other form placeholders.",
	"review label help label": "Label (headline) for context-sensitive help for the label field in the review form\n{{Identical|Label}}",
	"review label help": "Text for context-sensitive help for the label field in the review form. Feel free to localize the examples.",
	"review by url button label": "Button for switcher control that lets the user choose between reviewing something by specifying a URL, and other sources.",
	"review via wikidata help text": "Help text that is shown to the user when searching Wikidata",
	"review via openlibrary help text": "Help text that is shown when searching Open Library for review subjects.",
	"pick a review subject": "Label for the form input field that lets the user search Wikidata",
	"start typing to search wikidata": "Placeholder text for the form input field that lets the user search Wikidata",
	"start typing to search openlibrary": "Placeholder for input field when searching Open Library for review subjects.",
	"no relevant results": "Text that is shown when a search in Wikidata has yielded some results, but they have all eliminated by the title blacklist.",
	"load next page": "Navigation tooltip that is shown when a Wikidata search yields more than a certain number of results",
	"load previous page": "Navigation tooltip that is shown when the user has paginated through a search with more than a certain number of results",
	"more results": "Text, rendered in all-caps, that is shown below the Wikidata search results to indicate to the user that more results than shown are available.",
	"no search results": "Short text shown below the Wikidata search results to indicate that a search was unsuccessful.",
	"clear review subject": "Tooltip for icon that lets the user undo the choice of review subject for a review they are writing from scratch.",
	"wikidata source label": "Label that is used when describing review subject metadata sourced to Wikidata, or links to Wikidata.",
	"synced info": "Tooltip that is shown for information synchronized from an external source",
	"sync source": "Information that is shown for information synchronized from an external source. %s is replaced with the name of the source, such as 'Wikidata'.",
	"sync date": "Information that is shown for information synchronized from an external source. %s is replaced with the date.",
	"cannot edit synced field": "Error message that is shown when attempting to edit a field that is automatically updated from an external source.",
	"manage links": "Button label for managing links associated with a review subject; also used as title for the resulting page.",
	"manage links intro 1": "Introductory text shown on the page for managing links associated with a review subject.",
	"manage links intro 2": "Introductory text shown on the page for managing links associated with a review subject.",
	"enter web address short": "Placeholder text for form field on page for managing links associated iwth a review subject.",
	"update links": "Submit button label on page for managing links associated with a review subject.",
	"primary link": "Form header on page for managing links associated with a review subject. The primary link is the one chiefly identified with this subject.",
	"need primary": "Error message shown if user attempts to update links associated with a review subject without providing a primary link.",
	"links updated": "Success message shown if user has updated links associated with a review subject.",
	"web address already in use": "Error message shown if one of the addresses provided through the interface for managing links is already associated with another review subject.",
	"add more links": "Label for button that adds rows to the form for managing links associated with a review subject.",
	"databases tag label": "Label for a group of external links to databases regarding a review subject.",
	"other tag label": "Label for a group of external links regarding a review subject that we can't classify.",
	"summaries tag label": "Label for a group of external links to descriptions/summaries regarding a review subject.",
	"maps tag label": "Label for a group of external links to maps regarding a review subject.\n{{Identical|Map}}",
	"reviews tag label": "Label for a group of external links to additional review sites that have an entry for this review subject.",
	"opendata tag label": "Label for a group of external links to open data sources regarding a review subject.\n\n{{Identical|Open data}}",
	"shops tag label": "Label for a group of external links to online stores that relate to the review subject.",
	"imdb source label": "Label that is used when describing review subject metadata sourced to IMDb, or links to IMDb.",
	"amazon source label": "Label that is used when describing review subject metadata sourced to Amazon, or links to Amazon.",
	"goodreads source label": "Label that is used when describing review subject metadata sourced to Goodreads, or links to Goodreads.",
	"openstreetmap source label": "Label that is used when describing review subject metadata sourced to OpenStreetMap, or links to OpenStreetMap.",
	"openlibrary source label": "Label that is used when describing review subject metadata sourced to Open Library, or links to Open Library.",
	"yelp source label": "Label that is used when describing review subject metadata sourced to Yelp, or links to Yelp.",
	"tripadvisor source label": "Label that is used when describing review subject metadata sourced to TripAdvisor, or links to TripAdvisor.",
	"wikipedia source label": "Label that is used when describing links to Wikipedia.\n{{Identical|Wikipedia}}",
	"indiebound source label": "Label that is used when describing review subject metadata sourced to IndieBound, or links to IndieBound.",
	"steam source label": "Steam is a proper name and refers to https://en.wikipedia.org/wiki/Steam_(service)",
	"search databases button label": "Label for button that lets users search external databases for review subjects.",
	"review via wikidata help label": "Title for help text that is shown when the user accesses the feature that lets them search Wikidata",
	"review via openlibrary help label": "Help title that is shown when searching Open Library for review subjects.",
	"choose database": "Tooltip that is shown on the source selector dropdown for searching databases for review subjects.",
	"one edition": "Text that is shown in Open Library book searches for records with only a single known edition.",
	"multiple editions": "Text that is shown in Open Library book searches for records with multiple editions. %d is substituted with the number of editions as a decimal, and %s is substituted with a year string such as \"(1955 - 2015)\".",
	"single year": "Text that is shown in Open Library book searches to identify the year of an edition. %s is substituted with the year or the message \"unknown year\".",
	"year range": "Text that is shown in Open Library book searches to identify a range of years for the available editions. %1$d is substituted with the beginning of the range (longest ago) and %2$d with the end of the range (most recent year).",
	"unknown year": "Text that is shown in Open Library book searches for records without a year.",
	"html5 video not supported": "Message shown on pages with HTML5 video viewed through a browser that does not support it.",
	"html5 audio not supported": "Message shown on pages with HTML5 audio viewed through a browser that does not support it.",
	"html5 media fallback link": "Link that is part of the 'not supported' messages for HTML5 audio and video, offering the file for download since it cannot be played.",
	"html5 media description": "Description that is part of the 'not supported' messages for HTML5 audio and video, offering the file for download since it cannot be played.",
	"previously reviewed": "Part of a modal dialog that is shown when the user picks a review subject they have previously reviewed.",
	"abandon form changes": "Part of a modal dialog that is shown when the user picks a review subject they have previously reviewed. If the user chooses this option, they will leave the current page.",
	"pick a different subject": "Part of a modal dialog that is shown when the user picks a review subject they have previously reviewed.",
	"previously reviewed submission": "Error message that is shown when the user attempts to post a new review for a URL they have previously reviewed. This error will be caught pre-submission if JavaScript is enabled. %1$s is substituted with the relative URL of the review, %2$s with the relative URL to editing it.",
	"please enter description": "Error message shown in the rich-text editor if the user attempts to upload a file without entering a description.",
	"please specify rights": "Error message shown in the rich-text editor if the user attempts to upload a file without specifying the copyright status.",
	"caption": "Formatting string that is used for media files (images, sound, video) uploaded and inserted from within the rich-text editor. %1$s is substituted with the caption. %2$s is substituted with a credit line, such as 'Credit: The New York Times. Fair use.' or 'Own work. License: CC-BY-SA.'",
	"license in caption": "Feeds into the caption message and is used only for files with a free content license (i.e. not fair use or public domain files).",
	"public domain in caption": "Feeds into the caption message and is used only for files in the public domain.",
	"fair use in caption": "Feeds into the caption message and is used only for fair use files.",
	"rights in caption, own work": "Feeds into the caption message and is used only for files that are the user's own work. %s will be substituted with the license (normally CC-BY-SA).",
	"rights in caption, someone else's work": "Feeds into the caption message and is used as a credit line for files that are not the user's own work. %1$s will be substituted with the creator credited by the user, %2$s will be substituted with the license.",
	"source in upload summary": "Label that is used on the review subject (thing) page to identify the source for files associated with this review subject (typically a URL but doesn't have to be).",
	"uploaded files title": "Title for the chronological feed of all uploaded files.",
	"description": "Label that is typically used for file descriptions.\n{{Identical|Description}}",
	"uploader": "Label that is used on the feed of all uploaded files to identify the uploader of a given file.",
	"file usage": "Label that is used on the feed of all uploaded files to show which review subjects are associated with a given file.",
	"upload date": "Label that is used on the feed of all uploaded files to show the date a given file was uploaded.",
	"older files": "Navigation link that is used on the feed of all uploaded files to show another page of results.",
	"show uploads": "For users with JavaScript, label for the link on the review subject page that lets users expand the list of uploads.",
	"hide uploads": "For users with JavaScript, label for the link on the review subject page that lets users collapse the list of uploads.",
	"caption label": "Label that is used in the rich-text-editor for entering a caption via the 'Insert image' dialog.\n{{Identical|Caption}}",
	"source data licensing": "Label that is used on review subject pages that pull data from free/open community projects.",
	"wikidata license": "Explanatory text that is used on pages that pull data from Wikidata.",
	"openstreetmap license": "Explanatory text that is used on pages that pull data from OpenStreetMap.",
	"openlibrary license": "Explanatory text that is used on pages that pull data from OpenLibrary.",
	"data gratitude": "Notice that is used on pages that pull data from free/open community projects."
}
